
dist = {
    'a': [
        'a,â',
        'à,ầ',
        'á,ấ',
        'ạ,ậ',
        'ã,ẫ',
    ],
    'w' : [
        'uo,ươ',
        'a,ă',
        'o,ơ',
        'u,ư',
        'o,ơ',
    ],
    'o' : [
        'o,ô'
        'ò,ồ',
        'ó,ố',
        'ỏ,ổ',
        'õ,ỗ'
    ],
    'd': 'd,đ',
    'e': [
        'e,ê',
        'é,ế',
        'è,ề',
        'ẻ,ể',
        'ẽ,ễ',

    ],
    
    's':[
        'a,á',
        'ă,ắ',
        'â,ấ',
        'o,ó',
        'ơ,ớ',
        'ô,ố',
        'e,é',
        'ê,ế',
        'u,ú',
        'ư,ứ',
        'uo,úo',
        'ươ,ướ',
        'i,í'
    ],# sắc
    'f': [
        'a,à',
        'ă,ằ',
        'â,ầ',
        'o,ò',
        'ơ,ờ',
        'ô,ồ',
        'e,è',
        'ê,ề',
        'u,ù'
        'ư,ừ',
        'uo,ùo',
        'ươ,ườ',
        'i,ì'

    ],# huyền
    'j':[
        'a,ạ',
        'ă,ặ',
        'â,ậ',
        'o,ọ',
        'ơ,ợ',
        'ô,ộ',
        'e,ẹ',
        'ê,ệ',
        'u,ụ',
        'ư,ự',
        'uo,ụo',
        'ươ,ượ',
        'i,ị'

    ],# nặng
    'x':[
        'a,ã',
        'ă,ẵ',
        'â,ẫ',
        'o,õ',
        'ơ,ỡ',
        'ô,ỗ',
        'e,ẽ',
        'ê,ễ',
        'u,ũ',
        'ư,ữ',
        'uo,ũo',
        'ươ,ưỡ',
        'i,ĩ'
        
    ],# ngã
    'r': [
        'a,ả',
        'ă,ẳ',
        'â,ẩ',
        'o,ỏ',
        'ơ,ở',
        'ô,ổ',
        'e,ẻ',
        'ê,ể',
        'u,ủ',
        'ư,ử',
        'uo,ủo',
        'ươ,ưở',
        'i,ỉ'

    ]# hỏi

}

key_head = list(dist.keys())
key_head_ = key_head.copy()
for i in key_head:
    key_head_.append(i.upper())